# THIS FILE IS AUTOMATICALLY GENERATED
# Project: E:\final project\Workspace01\Jazzy_Dude.cydsn\Jazzy_Dude.cyprj
# Date: Tue, 13 May 2025 00:39:49 GMT
#set_units -time ns
create_clock -name {BPM_ADC_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {PITCH_ADC_theACLK(routed)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {sax_clk(routed)} -period 41666.666666666664 -waveform {0 20833.3333333333} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {piano_clk(routed)} -period 111000 -waveform {0 55500} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {Clock_1(routed)} -period 33000000 -waveform {0 16500000} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {BPM_ADC_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {PITCH_ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 25 49} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {BPM_ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 183 367} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {BPM_ADC_theACLK(fixed-function)} -period 7625 -waveform {0 3812.5} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 768001 1584001} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {sax_clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 993 2001} -nominal_period 41666.666666666664 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {piano_clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2657 5329} [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for E:\final project\Workspace01\Jazzy_Dude.cydsn\TopDesign\TopDesign.cysch
# Project: E:\final project\Workspace01\Jazzy_Dude.cydsn\Jazzy_Dude.cyprj
# Date: Tue, 13 May 2025 00:39:46 GMT
